import { Language } from "@/types/shared";

const kz: Language = {
    name: "Қаз",
    welcomeMessage: {
        welcomeText: (
            <>
                Қош келдіңіз! Сізді үйден шықпай-ақ жарысқа қатысуға шақырамыз.
                Қажеті – сенімді интернет байланысы мен жеңіске деген ынталылық.
                <br />
                <br /> Достарыңызбен немесе кездейсоқ қарсыласпен бәсекелесіңіз.
                Кім біледі, мүмкін, сіз Game of Drones турнирінің чемпионы
                боларсыз? <br />
                <br /> Сынаққа дайынсыз ба? Сайтта тіркеліңіз және жолға
                шығыңыз. Жарыстың қызығы мен адреналинін сезінуден мүмкіндікті
                жібермеңіз. Сәттілік тілейміз және ойыннан ләззат алыңыз!
                <br />
                <br /> Дайындалыңыз! Бастайық!
            </>
        ),
        signButtonText: "Кіру / Тіркеу",
        participantButtonText: "Турнирге қатысу",
    },
    authTabs: {
        signIn: "Кіру",
        signUp: "Тіркеу",
        signWith: "Көмегімен кіру",
    },
    confirmationCodeForm: {
        go_back: "Артқа",
        codeConfirm: "Растау коды",
        notifyEmail:
            "Сіздің электрондық поштаңызға растау коды бар SMS хабарлама жіберілді",
        retryEmailCode: "Растау кодын қайтадан жіберіңіз",
        confirmEmail: "Электрондық поштаны растау",
    },
    createPasswordPage: {
        createPassword: "Құпия сөз жасау",
        go_back: "Артқа",
        signUp: "Тіркелу",
        confirmPasswordPlaceholder: "Құпия сөзді қайталаңыз",
        passwordPlaceholder: "Құпия сөз жасаңыз",
    },

    loginForm: {
        resetPassword: "Құпия сөзді ұмыттыңыз ба?",
        emailPlaceholder: "Электрондық пошта",
        passwordPlaceholder: "Құпия сөз",
        signIn: "Кіру",
        privacyPolicy: (
            <>
                Жоғарыдағы түймені басу арқылы сіз{" "}
                <span className="underline">Құпиялылық саясаты</span> мен{" "}
                <span className="underline">Пайдаланушы келісімі</span>мен
                келісесіз
            </>
        ),
    },
    registerForm: {
        emailPlaceholder: "Электрондық пошта",
        passwordPlaceholder: "Құпия сөз",
        confirmPasswordPlaceholder: "Құпия сөзді растау",
        signIn: "Жалғастыру",
        privacyPolicy: (
            <>
                Мен <span className="underline">Құпиялылық саясаты</span> мен{" "}
                <span className="underline">Пайдаланушы келісімімен</span>{" "}
                таныстым және келісемін
            </>
        ),
    },
    welcome: {
        welcomeText: "Қош келдіңіз!",
        info: `Платформаның барлық мүмкіндіктерін пайдалану үшін
	қысқаша сауалнаманы толтырып, нұсқаулықты қараңыз. Айтпақшы, ол
	кіруден кейін де қолыңызда болады!`,
        exit: "Шығу",
        next: "Келесі",
    },

    editProfile: {
        personalInfo: "Жеке ақпарат",
        changePassword: "Құпия сөзді өзгерту",
        logout: "Шығу",
        save: "Сақтау",
        oldPassword: "Ескі құпия сөзді енгізіңіз",
        password: "Құпия сөз",
        repeatPassword: "Құпия сөзді растау",
    },
    profileDataForm: {
        editPhoto: "Фотосуретті өзгерту",
        photoUpload: "Фото жүктеу",
        last_name: "Тегі",
        first_name: "Аты",
        middle_name: "Әкесінің аты",
        changePassword: "Құпия сөзді өзгерту",
        back: "Артқа",
        save: "Сақтау",
    },
    profileCard: {
        editProfile: "Профильді өңдеу",
        replacePhoto: "Фотоны ауыстыру",
        deletePhoto: "Фотоны жою",
    },
    resetPassword: {
        password: "Құпия сөзді қалпына келтіру",
        info: "Электрондық пошта мекенжайыңызды енгізіңіз, біз сізге құпия сөзді қалпына келтіру туралы нұсқаулар жібереміз.",
    },
    homePage: {
        news: "Жаңалықтар",
        more: "Толығырақ",
        instruction: "Платформа бойынша нұсқаулық",
        balance: "Сіздің балансыңыз",
        currency: "тг.",
        replenishBalance: "Балансты толықтыру",
    },
    tabText: {
        main: "Басты бет",
        profile: "Профиль",
        tournaments: "Турнирлер",
        help: "Көмек",
    },
    tournamentsStatistics: {
        statistics: "Статистика",
        totalGames: "Барлық ойындар",
        totalWin: "Барлық жеңістер",
        date: "Күні",
        tournament: "Турнир",
        result: "Нәтиже",
        place: "Орын",
    },
    incomingTournament: {
        incoming: "Алдағы турнир",
        start: "Басталуға дейін",
        back: "Турнир бетіне қайту",
    },
    myIncomingTournamentList: {
        myTournaments: "Менің турнирлерім",
        listTournaments: "Турнирлер тізімі",
    },
    taskList: {
        tasks: "Тапсырмалар",
        endTask: "Тапсырмаларды аяқтаңыз және тәжірибе алыңыз",
        upTo: "Дейін",
        level: "дәреже.",
    },
    taskDetails: {
        reward: "Сыйақы",
        process: "Тапсырманың барысы",
        task: "Тапсырма",
        select: "Тізімнен біреуін таңдаңыз",
    },
    timeSlot: {
        place: "орын",
    },
    tournamentCard: {
        start_tournament: "Турнирдің басталуы",
        contribution: "Қатысушының үлесі",
        currency: "тг.",
        more_detailed: "Толығырақ",
    },
    tournamentDetail: {
        start_tournament: "Турнирдің басталуы",
        contribution: "Қатысушының үлесі",
        currency: "тг.",
        go_back: "Турнир бетіне қайту",
        go_forward: "Турнирге қатысу",
    },
    participatePage: { go_back: "Артқа" },
    tournamentEnrollCard: {
        upcoming: "Жақындағы турнир",
        start: "Басталуы",
        lets_go: "АЛҒА!",
    },
    trainingCardWithSlots: {
        training: "Жаттығу",
        select: "Жаттығудың қатысу күнін таңдаңыз",
        attention:
            "Назар аударыңыз! Таңдауды растағаннан кейін уақытын өзгерте алмайсыз.",
        confirm: "Растау",
    },
    trainingCard: {
        training: "Тренировка",
        select: "Выберите дату участия в тренировке",
    },
    helpPage: {
        question: "Сұрақ-Жауап",
        payment: "Төлемдер",
        rules: "Қатысу ережелері",
        privacyPolicy: "Жария келісім-шарт және құпиялылық саясаты",
        our_partners: "Біздің серіктестер",
    },
    FAQ: {
        have_questions: "Сұрақтарыңыз бар ма?",
        question1: "Турнир қашан өтеді?",
        answer1: "Күнделікті турнир үш күн қатарынан өтеді",
        question2: "Қатысу ақысы қанша?",
        answer2: "Бір бөлімнің турниріне қатысу ақысы",
        question3: "Бұл виртуалды жарыстар ма?",
        answer3:
            "Жоқ, ойыншылар онлайн қосылып, платформа арқылы Алматы қаласындағы арнайы трассада нақты машинкаларды басқарады",
        question4: "Жас шектеулері қандай?",
        answer4: "Game of Drones-қа 12 жастан бастап қатысуға болады",
    },
    homeLoyaut: {
        exit: "Выйти",
    },
    payment: {
        info: "Информация о платежах",
        paymentText: `Біздің сайт интернет-эквайрингке қосылған және сіз қызметті Visa немесе Mastercard банк картасымен төлей аласыз. Таңдалған тауарды немесе қызметті растағаннан кейін CloudPayments процессинг орталығының төлем беті бар қорғалған терезе ашылады, онда сізге банк картасының деректерін енгізу қажет. Карта ұстаушысының қосымша аутентификациясы үшін 3-D Secure протоколы қолданылады. Егер сіздің Эмитент банкіңіз осы технологияны қолдаса, Сіз қосымша сәйкестендіруден өту үшін оның серверіне бағытталасыз. Қосымша сәйкестендіру ережелері мен әдістері туралы ақпаратты Сізге Банк картасын берген Банктен тексеріңіз.Онлайн төлем қызметі Visa және MasterCard халықаралық төлем жүйелерінің ережелеріне сәйкес төлемнің құпиялылығы мен қауіпсіздігін сақтау қағидаттарында жүзеге асырылады, бұл үшін жабық байланыс арналары арқылы деректерді тексеру, шифрлау және берудің ең өзекті әдістері пайдаланылады. Банк картасының деректерін енгізу CloudPayments төлем бетіндегі қорғалған терезеде жүзеге асырылады.Төлем бетіндегі өрістерге карта нөмірін, карта иесінің атын, картаның жарамдылық мерзімін, үш таңбалы қауіпсіздік кодын (Visa үшін CVV2 немесе MasterCard үшін CVC2) енгізу қажет. Барлық қажетті деректер банк картасының бетінде көрсетіледі.CVV2 / CVC2 — картаның артқы жағында орналасқан үш таңбалы қауіпсіздік коды.Содан кейін сол терезеде 3-D Secure кодын енгізу үшін эмитент банктің беті ашылады. Егер Сізде статикалық 3-D Secure орнатылмаған болса, ол сіздің телефон нөміріңізге SMS арқылы жіберіледі. Егер 3-D Secure коды сізге келмесе, онда сіз Эмитент банкіңізге хабарласуыңыз керек.3 — D Secure-бұл интернет желісіндегі карталар бойынша төлемдердің қауіпсіздігін қамтамасыз етудің ең заманауи технологиясы. Операцияны жүзеге асыратын карта ұстаушының түпнұсқалығын біржақты анықтауға және алаяқтық карта операцияларының қаупін барынша азайтуға мүмкіндік береді.Қауіпсіздік кепілдіктері CloudPayments процессинг орталығы PCI DSS 3.0 қауіпсіздік стандарты бойынша банк картасының деректерін қорғайды және өңдейді. Ақпаратты төлем шлюзіне беру SSL шифрлау технологиясын қолдану арқылы жүзеге асырылады. Ақпаратты одан әрі беру Сенімділіктің ең жоғары деңгейіне ие жабық банктік желілер арқылы жүзеге асырылады. CloudPayments сіздің картаңыздың деректерін бізге және басқа үшінші тұлғаларға бермейді. Карта ұстаушысының қосымша аутентификациясы үшін 3-D Secure протоколы қолданылады.Егер Сізде жасалған төлем бойынша сұрақтарыңыз болса, төлем сервисінің клиенттерді қолдау қызметіне электрондық пошта арқылы хабарласа аласыз support@cloudpayments.kz. Онлайн төлемдердің қауіпсіздігі сіз ұсынатын жеке ақпарат (аты-жөні, мекен-жайы, телефоны, E-mail, несие картасының нөмірі) құпия болып табылады және жария етілмейді. Сіздің несие картаңыздың деректері тек шифрланған түрде беріледі және біздің веб-серверде сақталмайды.Интернет-төлемдерді өңдеу қауіпсіздігіне "CloudPayments Kazakhstan" ЖШС кепілдік береді. Төлем карталарының барлық операциялары VISA International, MasterCard және басқа төлем жүйелерінің талаптарына сәйкес жүзеге асырылады. Ақпаратты беру кезінде онлайн-карточкалық төлемдер қауіпсіздігінің мамандандырылған технологиялары пайдаланылады, деректерді өңдеу процессингтік компанияның қауіпсіз жоғары технологиялық серверінде жүргізіледі.Төлем карталарымен төлеу қауіпсіз, себебі:
Авторизация жүйесі сатып алушыға оның төлем картасының төлем деректемелері (нөмірі, жарамдылық мерзімі, CVV2/CVC2) алаяқтардың қолына түспеуін қамтамасыз етеді, өйткені бұл деректер авторизация серверінде сақталмайды және ұрланбайды.
Сатып алушы Төлем деректерін интернет-дүкеннің веб-сайтына емес, CloudPayments авторизация жүйесіне тікелей енгізеді, сондықтан сатып Алушы картасының төлем деректемелері үшінші тұлғаларға қол жетімді болмайды.Төлем карталары арқылы онлайн-төлем жүргізу кезінде қолма-қол ақшамен қайтаруға жол берілмейді. Қайтару тәртібі халықаралық төлем жүйелерінің ережелерімен реттеледі:
Тұтынушы тауарды бергенге дейін кез келген уақытта бас тартуға құқылы, тауарды бергеннен кейін бас тартуды 14 күн ішінде ресімдеу қажет;
Егер оның тауарлық түрі, тұтыну қасиеттері, сондай-ақ аталған тауарды сатып алу фактісі мен шарттарын растайтын құжат сақталған жағдайда, тиісті сападағы тауарды қайтару мүмкін болады;
Егер көрсетілген тауарды тек оны сатып алатын адам ғана пайдалана алатын болса, тұтынушы жеке-белгілі бір қасиеттері бар тиісті сападағы тауардан бас тартуға құқылы емес;
Тұтынушы тарапынан тауардан бас тартқан кезде сатушы тұтынушы тиісті талап қойған күннен бастап он күннен кешіктірмей тұтынушы төлеген ақшалай соманы оған қайтаруға тиіс.
Қолма-қол ақшаны банк картасына қайтару үшін компанияның сұранысы бойынша электронды мекен-жайға жіберілетін "ақшаны қайтару туралы өтінішті" толтырып, оны жеке басын куәландыратын құжаттың көшірмесімен бірге nm@lincoln мекен-жайына жіберу керек.company.Ақша қаражатын қайтару компанияның "ақша қаражатын қайтару туралы өтінішті" алған күннен бастап ___ жұмыс күні ішінде банк картасына жүзеге асырылады.Қателіктермен жүргізілген операциялар бойынша ақшалай қаражатты қайтару үшін жазбаша өтінішпен және құжаттың көшірмесімен бірге жүгіну қажет, және қате есептен шығарылғанын растайтын чектер/түбіртектер. Бұл өтінішті nm@lincoln мекенжайына жіберу керек.company.Қайтару сомасы сатып алу сомасына тең болады. Өтінішті қарау және ақшалай қаражатты қайтару мерзімі компания өтінішті алған сәттен бастап есептеле бастайды және мереке/демалыс күндерін есептемегенде жұмыс күндерінде есептеледі.Төлем жасаудан бас тарту жағдайлары:
банк картасы интернет арқылы төлем жасауға арналмаған, ол туралы эмитент-банкке хабарласу арқылы білуге болады;
банк картасында төлеуге қаражат жеткіліксіз. Төлем картасында қаражаттың болуы туралы толығырақ банк картасын шығарған банкке хабарласу арқылы біле аласыз;
банк картасының деректері дұрыс енгізілмеген;
банк картасының мерзімі аяқталды. Картаның жарамдылық мерзімі әдетте картаның алдыңғы жағында болады(бұл карта жарамды ай мен жыл). Картаның жарамдылық мерзімі туралы толығырақ эмитент банкке хабарласу арқылы біле аласыз.
Банктік карта арқылы төлем жасау және сайттың жұмысына қатысты басқа да мәселелер бойынша сіз келесі телефондарға жүгіне аласыз: сіздің телефон нөміріңіз.Құпиялылық1. Анықтамаларыинтернет жобасы https://gameofdrones.kz / (бұдан әрі – URL, "біз") өз клиенттері мен сайтқа кірушілердің ақпаратының құпиялылығы мәселесіне байыпты қарайды https://gameofdrones.kz/ (бұдан әрі - "сіз","сайтқа кірушілер"). Біз сайтқа кірушінің жеке деректері бар ақпаратты (мысалы: аты-жөні, логині немесе компания атауы), сондай-ақ вамиl сайтында жасаған әрекеттеріңіз туралы ақпаратты дербестендірілген деп атаймыз. (мысалы: сайтқа кірушіге оның байланыс ақпаратымен тапсырыс беру). Анонимді деп біз белгілі бір сайтқа кірушімен нақты Анықталмайтын деректерді атаймыз (мысалы: сайт трафигі статистикасы).2. Ақпаратты пайдаланубіз сайттың белгілі бір келушісінің жеке ақпаратын тек оған сапалы қызмет көрсетуді және оларды есепке алуды қамтамасыз ету үшін қолданамыз. Біз URL сайтына кірушілердің жеке деректерін басқа сайтқа кірушілерге ашпаймыз. Біз ешқашан жеке ақпаратты ашық түрде жарияламаймыз және оны үшінші тұлғаларға бермейміз. Мұндай ақпаратты уәкілетті мемлекеттік органдарға беру Қазақстан Республикасының қолданыстағы заңнамасында белгіленген жағдайлар ғана ерекшелік болып табылады. Біз жиналған анонимді деректерге негізделген есептерді ғана жариялаймыз және таратамыз. Бұл ретте есептерде қызметтерді пайдаланушылардың дербестендірілген деректерін сәйкестендіруге болатын ақпарат жоқ. Біз сондай-ақ URL3 өнімдері мен қызметтерін дамытуға бағытталған ішкі талдау үшін анонимді деректерді пайдаланамыз. Сілтемелерсайт https://gameofdrones.kz / біздің компанияға қатысы жоқ және үшінші тұлғаларға тиесілі басқа сайттарға сілтемелерді қамтуы мүмкін. Біз үшінші тұлғалардың сайттарында орналастырылған мәліметтердің дәлдігі, толықтығы және дұрыстығы үшін жауап бермейміз және сіз осындай сайттарда қалдырған ақпараттың құпиялылығын сақтау бойынша ешқандай міндеттеме алмаймыз.4. Жауапкершілікті шектеубіз осы құпиялылық саясатын сақтау үшін қолдан келгеннің бәрін жасаймыз, алайда біздің ықпалымыздан тыс факторлардың әсерінен ақпараттың сақталуына кепілдік бере алмаймыз, оның нәтижесі ақпаратты ашу болады. Сайт https://gameofdrones.kz / және онда орналастырылған барлық ақпарат ешқандай кепілдіксіз "сол күйінде" ұсынылады. Біз қолайсыз салдарлар үшін, сондай-ақ URL сайтына кіруді шектеу немесе сайтқа кіру және онда орналастырылған ақпаратты пайдалану салдарынан келтірілген кез келген залалдар үшін жауап бермейміз.5. Байланыстаросы саясатқа қатысты мәселелер бойынша nm@lincoln мекенжайына хабарласыңыз.сомрапууридическое тұлға " GameofDrones Ltd."Заңды мекенжайы: Қазақстан Республикасы, Астана қаласы, Есіл ауданы, ПроспектМангилик Ел, 55/8 ғимарат, пошта индексі 020000БИН: 220740900245иик: KZ698562203121165992АО "Банк ЦентрКредит"БСК: Kcjbkzkxkbe 17email: nm@lincoln.company`,
    },
    rules: {
        info: "Правила участия",
        rulesText: `Нағыз ойын-бұл киберспорт пәніне қызығушылық таныту, қалыптастыру және қолдау үшін өткізілетін маркетингтік іс-шара.Ойын лотерея емес және өмірге қауіп төндірмейді. Ойынға қатысу осы Ережеге сәйкес жүргізіледі. Ойынға қосыла отырып, қатысушылар белгіленген ережелермен толық келіседі.1. Жалпы ережелер1. 1. Ойынның атауы " game of Drones "(мәтіннен жоғары және одан әрі – "ойын").1.2. Ойын өтетін орын: қону беті: https://gameofdrones.kz1.3. Ойын өткізу мерзімі: - С "Х" _________ 2023 "Х" бойынша жыл" _______ 202__ жыл.1.4. Ойынға сайтта тіркелген жеке тұлғалар қатыса алады https://gameofdrones.kz, (бұдан әрі - "ұшқыштар"/"ойын қатысушылары").2. Ойынның басқа шарттары2.1. Ойынды ұйымдастырушы кез келген уақытта ойынның ережелері мен мерзімін өзгерте алады, соның ішінде сайтта жаңартылған ережелер мен басқа ақпаратты жариялау арқылы ойынды тоқтата алады https://gameofdrones.kz.Датой хабарламалар болып табылады тиісті ақпараттың жарияланған күні.2.2. Ойынды ұйымдастырушы ойынға қатысуды өз қалауы бойынша жарамсыз деп тануға, ойынға қатысуға тыйым салуға, ойынға қатысушылар осы Ережелерді бұзған, ойынға қатысушылардың берілген құқықтарды теріс пайдалану фактілері анықталған, өз аккаунтына қол жеткізуді үшінші тұлғаларға таратқан не қол жеткізуді бұрмалауға тырысқан жағдайда ойынға қатысуға жол бермеуге құқылы.2.3. Ойынға кіруді белсендіру мүмкін вопросамстігі немесе оны сайтта алмау мәселелері бойынша ойынға қатысушылар ұйымдастырушыға мына сілтеме бойынша жүгіне алады: https://gameofdrones.kz.2.5. Ойын ұйымдастырушысы қатысушы жағында сапасыз қосылымды пайдалану кезінде орын алуы мүмкін техникалық ақаулар үшін жауап бермейді, нәтижесінде ойынға қатысушы қол жеткізе алмайды. Ойын ұйымдастырушысы ойынға қатысушының техникалық ерекшеліктеріне және/немесе параметрлеріне байланысты ойынның функционалдығын қолдамайтын құрылғыны пайдалануы нәтижесінде ойынға қол жеткізе алмағаны үшін жауап бермейді.2.6. Ойынға қатысушылар ойынға қатысуға байланысты барлық шығындарды өз бетінше көтереді.2.7. Ойынға қатысушы тіркеу кезінде өзінің сенімді жеке деректерін көрсетуге міндетті: аты-жөні, жасы, email, телефон нөмірі және ЖСН.Ойын сайтында тіркеле отырып, қатысушы өзінің жеке деректерін өңдеуге және жинауға рұқсат береді.Ойын сайтында тіркеле отырып, қатысушы жарнамалық мақсатта жалпы ағынмен ойынды таратуға рұқсат береді.2.8. Ойынға қатысушылар: ойынның басқа қатысушылары мен ұйымдастырушыларына құрметпен қарауға; алкогольдік, есірткілік немесе психотроптық мас күйінде болмауға; балағат сөздерді қолданбауға міндетті.2.9. Ойынға қатысушы брондалған уақытты жаттығуға және ойынға, оның ішінде турнирге қатысуға өткізген кезде қатысу үшін төлем қайтарылмайды.`,
    },
    privacyPolicy: {
        info: "Публичный договор-оферта и политика конфиденциальность",
        privacyPolicyText: `Осы Шарт бұдан әрі "Тапсырыс беруші" деп аталатын кез келген жеке/заңды тұлғаға немесе дара кәсіпкерге жолданған, осы жария оферта шарттарымен оның толық және сөзсіз акцепті арқылы келісілген ресми ұсыныс болып табылады.Тапсырыс беруші төлем енгізілген сәтке дейін осы құжатпен толық танысуға міндетті.Жеке Компания " GameofDrones Ltd.", Жарғы негізінде әрекет ететін директор Айтен Бексұлтан Берікұлы атынан, бұдан әрі" Орындаушы "деп аталатын осы жария оферта шартының (бұдан әрі-"шарт") талаптарында Тапсырыс берушімен ақылы қызметтер көрсету туралы шарт жасасу ниетін білдіреді.1. ТЕРМИНДЕР МЕН АНЫҚТАМАЛАР: 1.1. Оферта-сайтта жарияланған осы құжат: https://gameofdrones.kz.1.2. оферта акцепті-Тапсырыс беруші осы Шарттың 4-бөлімінде көрсетілген әрекеттерді жүзеге асыру жолымен оферта толық және сөзсіз қабылдауы. Ұсыныс акцепті келісімшарт жасайды.1.3. Қызметтер - Орындаушы Тапсырыс берушіге ойынға қатысу бойынша ұсынатын қызметтер.1.4. Тапсырыс беруші-Офертаны акцептеуді жүзеге асырған және осылайша осы Шарт бойынша Орындаушының қызметтеріне тапсырыс беруші болып табылатын тұлға.1.5. Сайт-қызметтердің мазмұны мен құны туралы толық ақпаратты қамтитын, мына мекенжайда орналастырылған интернет-ресурс: https://gameofdrones.kz.1.6.ойын — "game of Drones".Осы бөлімде тікелей айқындалмаған өзге де ұғымдар мен анықтамалар Қазақстан Республикасының заңнамасына сәйкес түсіндіріледі.2. ШАРТТЫҢ МӘНІ: 2.1. Орындаушы ұсынады, ал Тапсырыс беруші сайттағы қызметтерге ақы төлейді.2.2. Шарт бойынша қызметтердің құны Орындаушының сайтында хабарланады.2.3. Осы Шарт Қазақстан Республикасы Азаматтық Кодексінің 395-бабына сәйкес Орындаушының жеке тұлғалардың, заңды тұлғалардың және дара кәсіпкерлердің атына жария офертасы болып табылады.2.4. Тапсырыс берушінің Шарт бойынша Орындаушының қызметтері үшін төлем шотына төлемді жүзеге асыруы осы Шарттың талаптарын сөзсіз қабылдау (Офертаны акцептеу) болып саналады.2.5. Оферта акцепті жасалған сәттен бастап Тапсырыс беруші осы Шарттың талаптарымен танысқан және келіскен болып есептеледі және Қазақстан Республикасының Азаматтық Кодексіне сәйкес орындаушымен осы шарттарда шарттық қатынастарға түскен болып есептеледі.3. ТАРАПТАРДЫҢ МІНДЕТТЕРІ:3.1. Орындаушының Міндеттері:3.1.1. Қызметтердің тиісті сапалы орындалуын ұйымдастыру және қамтамасыз ету;3.1.2. Тапсырыс беруші тіркеуден өткеннен кейін және қызметтер үшін төлемді жүзеге асырғаннан кейін Тапсырыс берушіні сайттағы ойынға қолжетімділікпен қамтамасыз ету.3.1.3. Сайттың техникалық ақауларына байланысты ойынға қол жетімділік болмаған жағдайда, Орындаушы ақауларды ақылға қонымды мерзімде жоюға міндетті.3.1.4. Осы Шартқа №1 қосымшада баяндалған ойынға қатысу ережелерін сақтау.3.2. Тапсырыс Берушінің Міндеттері:3.3.1. Сайтта тіркелу кезінде дұрыс ақпарат беру және бұл ақпаратты сайттағы жеке кабинетте (жеке бетте) өзекті күйде ұстау. Бұл ретте Орындаушы Тапсырыс беруші көрінеу дұрыс емес (жалған) ақпарат ұсынған жағдайда Тапсырыс берушіге Қызмет көрсетуден бас тартуға құқылы.3.2.1. Осы Шарттың талаптарына сәйкес төлемді жүзеге асыру.4. ҚЫЗМЕТТЕР ҮШІН ТӨЛЕМ:4.1. Тапсырыс беруші Шарттың 2.1-тармағында көрсетілген қызметтерді сайттың төлем бетінде теңгемен төлейді.4.2. Тапсырыс беруші ойынға қатысқанға дейін Орындаушының қызметтеріне қолма-қол ақшасыз төлем арқылы 100% алдын ала төлем мөлшерінде ақы төлейді.5. АВТОРЛЫҚ ҚҰҚЫҚТЫ САҚТАУ5. 1. Тапсырыс беруші Қазақстан Республикасының заңнамасына сәйкес Орындаушының ойынға авторлық құқығын сақтауға міндетті.5.2. Тапсырыс берушіге кез-келген бейне немесе мәтіндік материалдарды көшіруге тыйым салынады.5.3. Тапсырыс берушіге Ойынды немесе оның фрагменттерін коммерциялық мақсатта, өз атынан пайдалануға, ашық қол жетімділікке орналастыруға, үшінші тұлғаларға беруге тыйым салынады.5.4. Тапсырыс берушіге сайтқа кіру логині мен паролін үшінші тұлғаларға беруге тыйым салынады. Үшінші тұлғалардың ойынға қол жеткізу фактісін анықтау Орындаушының қолма-қол ақшаны қайтармай-ақ шартты біржақты бұзуы үшін негіз болып табылады.6. САЙТТА ТІРКЕЛУ, ҚҰПИЯЛЫЛЫҚ ЖӘНЕ ДЕРБЕС ДЕРЕКТЕРДІ ҚОРҒАУ: 6.1. Тапсырыс беруші сайтты пайдалану және шарт бойынша қызметтерді алу Сайтта тіркеу рәсімінен өтуге әкеп соқтырады деп келіседі.6.2. Орындаушыға өзінің дербес деректерін ұсына отырып, Тапсырыс беруші Орындаушының оларды өңдеуіне, оның ішінде Орындаушының осы Шарт шеңберінде Тапсырыс беруші алдындағы міндеттемелерін орындауы, Орындаушының қызметтерді ілгерілетуі, әртүрлі мессенджерлердің қаражаты бойынша электрондық және сауалнамалар жүргізуі, маркетингтік акциялардың нәтижелерін бақылау, клиенттік қолдау, Тапсырыс берушінің қанағаттанушылығын бақылау, сондай-ақ Орындаушы көрсететін қызметтердің сапасын бақылау мақсатында келіседі.6.3. Дербес деректерді өңдеу деп Жинау, жазу, жүйелеу, жинақтау, сақтау, нақтылау (жаңарту, өзгерту) алуды, пайдалануды, иесіздендіруді, бұғаттауды, жоюды, жоюды қоса алғанда, автоматтандыру құралдарын пайдалана отырып немесе дербес деректермен осындай құралдарды пайдаланбай Орындаушы жасайтын кез келген іс-әрекет (операция) немесе іс-әрекеттер (операциялар) жиынтығы түсініледі Дербес деректер.6.4. Орындаушы Тапсырыс берушіден алынған ақпаратты жария етпеуге міндеттенеді. Тапсырыс берушінің орындаушымен шарт негізінде әрекет ететін агенттерге және үшінші тұлғаларға Тапсырыс беруші алдындағы міндеттемелерді орындау үшін ақпарат беруі бұзушылық болып саналмайды. Заңнаманың негізделген және қолданылатын талаптарына сәйкес ақпаратты жария ету міндеттемелерді бұзу болып саналмайды. Орындаушы "cookies" технологиясын пайдалануға құқылы. "Cookies" құпия ақпаратты қамтымайды және үшінші тұлғаларға берілмейді. Орындаушы сайтқа кірушінің ip мекенжайы туралы ақпарат алады. Бұл ақпарат Тапсырыс берушінің алаяқтық әрекеттерін қоспағанда, Тапсырыс берушінің жеке басын анықтау үшін пайдаланылмайды.6.5. Тапсырыс беруші Орындаушыға берілетін дербес деректердің дұрыстығына жауапты болады.6.6. Тапсырыс беруші үшінші тұлғалардың Сайтта құпия сөзді және Тапсырыс берушінің Жеке кабинетіне рұқсатсыз кіруі үшін жауапты болады және жеке кабинетке кіру деректерінің құпиялылығын қамтамасыз етеді. Тапсырыс беруші Тапсырыс берушінің Жеке кабинетін пайдаланудың барлық әрекеттері мен зардаптары, соның ішінде рұқсатсыз қол жеткізу, сондай-ақ Тапсырыс берушінің Жеке кабинетіне үшінші тұлғаларға қол жеткізу үшін деректерді Тапсырыс берушінің ерікті түрде беруі үшін жауапты болады. Бұл ретте Тапсырыс берушінің Жеке кабинеті шеңберіндегі немесе оны пайдалана отырып жасалған барлық іс-әрекеттерді Тапсырыс берушінің өзі жүргізген болып есептеледі.7. БАСҚА ШАРТТАР: 7.1. Орындаушы кез келген уақытта сайтта өзгертілген талаптардың жариялануын қамтамасыз ете отырып, Тапсырыс берушімен алдын ала келіспей, шарттың талаптарын біржақты тәртіппен өзгертуге құқылы. Орындаушы ықтимал тәуекелдер мен қауіпсіз пайдалану шарттары бойынша, сондай-ақ желілік шабуылдар немесе сайтты бұзу (оның ішінде, бірақ онымен шектелмей), техникалық себептерден туындаған сайттың жұмысындағы іркілістер үшін жауапты болмайды.7.2. Тараптар еңсерілмейтін күштің әрекет ету уақытына шарт бойынша міндеттемелерді орындамағаны немесе тиісінше орындамағаны үшін жауаптылықтан босатылады. Еңсерілмейтін күш деп Тараптардың Шарт бойынша өз міндеттемелерін орындауына кедергі келтіретін Төтенше және еңсерілмейтін мән-жайлар түсініледі. Оларға табиғи құбылыстар, соғыстар, қарулы көтеріліс, жаппай тәртіпсіздіктер, эпидемиялар, террористік әрекеттер, ереуілдер және т.б. жатады.7.3. Осы Шарт бойынша құқықтық қатынастардан туындайтын барлық даулар мен келіспеушіліктер келіссөздер арқылы шешіледі. Келіссөздер барысында туындаған дауларды шешу мүмкін болмаған жағдайда, мұндай даулар шағым жасау тәртібін міндетті түрде сақтай отырып, Қазақстан Республикасының, Алматы қаласының сотына шешімге берілуге тиіс. Шағымға жауап беру мерзімі алынған күннен бастап 10 (он) күнтізбелік күнді құрайды.7.4. Тараптар Қазақстан Республикасының қолданыстағы заңнамасына сәйкес шарт бойынша өз міндеттемелерін орындамағаны және/немесе тиісінше орындамағаны үшін жауапты болады.7.5. Осы Шарт осы Офертаны Тапсырыс беруші Офертаны акцептеген сәттен бастап күшіне енеді және Тараптар өзіне алған міндеттемелерді толық орындағанға дейін қолданылады.7.6. Сайтта жарияланған суреттер мен материалдар авторлық құқықпен қорғалған. Материалдарды кез-келген пайдалану Орындаушының жазбаша рұқсатымен ғана мүмкін болады.Орындаушының деректемелері: "GAMEOFDRONES Ltd."Заңды мекенжайы: Қазақстан Республикасы, Астана қаласы, Есіл ауданы, Мәңгілік Ел даңғылы, 55/8 ғимарат, пошталық индексі 020000БИН: 220740900245иик: KZ698562203121165992АО "Банк ЦентрКредит" БСК: Kcjbkzkxkbe 17."Game of Drones"ойынына қатысу ережелері Бұл ойын-бұл киберспорт пәніне қызығушылық таныту, қалыптастыру және қолдау үшін өткізілетін маркетингтік іс-шара.Ойын лотерея емес және өмірге қауіп төндірмейді. Ойынға қатысу осы Ережеге сәйкес жүргізіледі. Ойынға қосыла отырып, қатысушылар белгіленген ережелермен толық келіседі.1. Жалпы ережелер1. 1. Ойынның атауы " game of Drones "(мәтіннен жоғары және одан әрі – "ойын").1.2. Ойын өтетін орын: қону беті: https://gameofdrones.kz1.3. Ойын өткізу мерзімі: - С "Х" _________ 2023 "Х" бойынша жыл" _______ 202__ жыл.1.4. Ойынға сайтта тіркелген жеке тұлғалар қатыса алады https://gameofdrones.kz, (бұдан әрі - "ұшқыштар"/"ойын қатысушылары").2. Ойынның басқа шарттары2.1. Ойынды ұйымдастырушы кез келген уақытта ойынның ережелері мен мерзімін өзгерте алады, соның ішінде сайтта жаңартылған ережелер мен басқа ақпаратты жариялау арқылы ойынды тоқтата алады https://gameofdrones.kz.Датой хабарламалар болып табылады тиісті ақпараттың жарияланған күні.2.2. Ойынды ұйымдастырушы ойынға қатысуды өз қалауы бойынша жарамсыз деп тануға, ойынға қатысуға тыйым салуға, ойынға қатысушылар осы Ережелерді бұзған, ойынға қатысушылардың берілген құқықтарды теріс пайдалану фактілері анықталған, өз аккаунтына қол жеткізуді үшінші тұлғаларға таратқан не қол жеткізуді бұрмалауға тырысқан жағдайда ойынға қатысуға жол бермеуге құқылы.2.3. Ойынға кіруді белсендіру мүмкін вопросамстігі немесе оны сайтта алмау мәселелері бойынша ойынға қатысушылар ұйымдастырушыға мына сілтеме бойынша жүгіне алады: https://gameofdrones.kz.2.5. Ойын ұйымдастырушысы қатысушы жағында сапасыз қосылымды пайдалану кезінде орын алуы мүмкін техникалық ақаулар үшін жауап бермейді, нәтижесінде ойынға қатысушы қол жеткізе алмайды. Ойын ұйымдастырушысы ойынға қатысушының техникалық ерекшеліктеріне және/немесе параметрлеріне байланысты ойынның функционалдығын қолдамайтын құрылғыны пайдалануы нәтижесінде ойынға қол жеткізе алмағаны үшін жауап бермейді.2.6. Ойынға қатысушылар ойынға қатысуға байланысты барлық шығындарды өз бетінше көтереді.2.7. Ойынға қатысушы тіркеу кезінде өзінің сенімді жеке деректерін көрсетуге міндетті: аты-жөні, жасы, email, телефон нөмірі және ЖСН.Ойын сайтында тіркеле отырып, қатысушы өзінің жеке деректерін өңдеуге және жинауға рұқсат береді.Ойын сайтында тіркеле отырып, қатысушы жарнамалық мақсатта жалпы ағынмен ойынды таратуға рұқсат береді.2.8. Ойынға қатысушылар: ойынның басқа қатысушылары мен ұйымдастырушыларына құрметпен қарауға; алкогольдік, есірткілік немесе психотроптық мас күйінде болмауға; балағат сөздерді қолданбауға міндетті.2.9. Ойынға қатысушы брондалған уақытты жаттығуға және ойынға, оның ішінде турнирге қатысуға өткізген кезде қатысу үшін төлем қайтарылмайды.`,
    },
};
export default kz;
